/* ========================================================================
 * zzw: code.js v0.1.0
 * ========================================================================
 * Copyright 2016-2017 559hs.
 * ======================================================================== */
/**
 * [code tips返回文本信息]
 * @type {Object}
 */
var code = {
	'0':{
		msg: '操作成功!',
		detail: '操作成功，无返回值'
	},
	'-1':{
		msg: '未选中任何信息',
		detail: '表格操作时，需要选中信息以获取参数才可以执行以下操作'
	},
	'-2':{
		msg: 'code返回文本信息设置出错',
		detail: 'code.js文件中，没有对应的参数回调'
	},
	'-3':{
		msg: '表单验证未通过'
	},
	'-4':{
		msg: '表单未设置action属性'
	},
	'-8':{
		msg: '请求未初始化,登录已过期，请重新登录系统！'
	}
}